Tekla Open API Reference for Tekla Structures 2025
DrawingHandler.PrintDrawing Method
Overload List
Name | Description
PrintDrawing(Drawing, DPMPrinterAttributes)
 Prints the drawing using the given printer attributes.
PrintDrawing(Drawing, PrintAttributes)
 Prints the drawing using the given printer instance. NOTE! The drawing cannot be active, otherwise printing fails.
PrintDrawing(Drawing, DPMPrinterAttributes, String)
 Prints the drawing to file using the given printer attributes and name of the output file. The given output file overrides the printer attributes file settings.
PrintDrawing(Drawing, PrintAttributes, String)
 Prints the drawing to file using the given printer instance. NOTE! The drawing cannot be active, otherwise printing fails.
Top
See Also
Reference
DrawingHandler Class
Tekla.Structures.Drawing Namespace